In [1]:
person = {
    "first": "Corey",
    "last": "Schafer",
    "email": "CoreyMSchafer@gmail.com"
}

In [2]:
people = {
    "first": ["Corey"],
    "last": ["Schafer"],
    "email": ["CoreyMSchafer@gmail.com"]
}

In [55]:
people = {
    "first": ["Corey", 'Jane', 'John', 'Adam'],
    "last": ["Schafer", 'Doe', 'Doe', 'Doe'],
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com', 'A@email.com']
}

In [4]:
people['email']

['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com']

In [5]:
import pandas as pd

In [56]:
df = pd.DataFrame(people)

In [30]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [8]:
df['email']

0    CoreyMSchafer@gmail.com
1          JaneDoe@email.com
2          JohnDoe@email.com
Name: email, dtype: object

In [9]:
type(df['email'])

pandas.core.series.Series

In [10]:
df.email

0    CoreyMSchafer@gmail.com
1          JaneDoe@email.com
2          JohnDoe@email.com
Name: email, dtype: object

In [11]:
df[['last', 'email']] #putting a list into the brackets

      last                    email
0  Schafer  CoreyMSchafer@gmail.com
1      Doe        JaneDoe@email.com
2      Doe        JohnDoe@email.com

In [12]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [13]:
df.iloc[0] #integer locator, returns a series of the values of the first row of data, the number is the index

first                      Corey
last                     Schafer
email    CoreyMSchafer@gmail.com
Name: 0, dtype: object

In [14]:
df.iloc[[0,1]] #selecting rows 1 and 2 of the data

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com

In [15]:
df.iloc[[0,1],2] #selecting rows 1 and 2 of the data along with column 2

0    CoreyMSchafer@gmail.com
1          JaneDoe@email.com
Name: email, dtype: object

In [16]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [17]:
df.loc[0] #locator, returns a series of the values of the first row of data, the number is the index

first                      Corey
last                     Schafer
email    CoreyMSchafer@gmail.com
Name: 0, dtype: object

In [18]:
df.loc[[0,1]]

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com

In [19]:
df.loc[[0,1],'email'] #can uses labels since we AREN'T using the integer locator

0    CoreyMSchafer@gmail.com
1          JaneDoe@email.com
Name: email, dtype: object

In [20]:
df.loc[[0,1],['email','last']] #selecting rows 1 and 2 of the data along with the 'email' and 'last' columns
#(ORDER MATTERS!)

                     email     last
0  CoreyMSchafer@gmail.com  Schafer
1        JaneDoe@email.com      Doe

In [21]:
df['email'] #access email column

0    CoreyMSchafer@gmail.com
1          JaneDoe@email.com
2          JohnDoe@email.com
Name: email, dtype: object

In [22]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [23]:
df.set_index('email', inplace=True) #sets email as the index and tells Pandas to use this in future df print outs
#inplace=True tells Pandas to carry over the changes

In [24]:
df

                         first     last
email
CoreyMSchafer@gmail.com  Corey  Schafer
JaneDoe@email.com         Jane      Doe
JohnDoe@email.com         John      Doe

In [25]:
df.index

Index(['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com'], dtype='object', name='email')

In [26]:
df.loc['CoreyMSchafer@gmail.com']

first      Corey
last     Schafer
Name: CoreyMSchafer@gmail.com, dtype: object

In [27]:
df.loc['CoreyMSchafer@gmail.com', 'last']

'Schafer'

In [28]:
df.loc[0] #will get a type error because we changed the 0:2 index to be the emails -> must use iloc

KeyError: 0

In [ ]:
df.iloc[0]

In [ ]:
df.reset_index(inplace=True) #resets to original df and carries over the change
df

In [ ]:
filt = (df['last'] == 'Schafer') | (df['first'] == 'John') #gives back T/F logic in a series -> be careful since filter is a Python keyword

In [ ]:
filt

In [ ]:
df[filt] #returns a data frame consisting of rows with the last name 'Doe'

In [ ]:
df.loc[filt] #same as above, there are multiple ways to get the same results

In [ ]:
df.loc[~filt, 'email'] #first value is rows we want, second value is columns that we want

In [ ]:
df.columns

In [ ]:
df.columns

In [ ]:
df.columns = ['first_name','last_name','email']
df

In [ ]:
df.columns = [x.upper() for x in df.columns]
df

In [ ]:
df.columns = df.columns.str.replace(' ','_')
df

In [ ]:
df.columns = [x.lower() for x in df.columns]
df

In [ ]:
df.rename(columns={'first_name': 'first', 'last_name': 'last'},inplace=True)
df

In [ ]:
df.loc[2] = ['John','Smith','JohnSmith@email.com'] #updating row 2
df

In [ ]:
df.loc[2, ['last','email']] = ['Doe','JohnDoe@email.com']
df

In [ ]:
df.loc[2, 'last'] = 'Smith' #updates just the 1 value in row 2 (a single value)
df

In [ ]:
df.at[2, 'last'] = 'Doe' #re-updates just the 1 value in row 2 (a single value)
df

In [ ]:
filt = (df['email'] == 'JohnDoe@email.com')
df[filt]['last'] = 'Smith' #this doesn't work because multiple operations are needed in the background

In [ ]:
df

In [ ]:
filt = (df['email'] == 'JohnDoe@email.com')
df.loc[filt,'last'] = 'Smith' #this syntax works!
df

In [ ]:
df['email'].str.lower() #returns all values of emails as lowercase

In [ ]:
df['email'] = df['email'].str.lower() #returns all values of emails as lowercase AND makes the change to the df
df

In [ ]:
df['email'].apply(len) #counts the characters of the email addresses

In [ ]:
def update_email(email):
    return email.upper()

In [ ]:
df['email'].apply(update_email) #want to pass in the function WITHOUT executing
                                    #no parentheses after function name

In [ ]:
df['email'] = df['email'].apply(update_email) #assigns email values as all uppercase
df

In [ ]:
df['email'] = df['email'].apply(lambda x: x.lower()) #lambda function
df

In [ ]:
df['email'].apply(len) #recopied here so we can evaluate it on a data frame

In [ ]:
df.apply(len) #applies the length function to each series (each column) in the data frame
                #'first' has 3 values; 'last' has 3 values, 'email' has 3 values (counts DOWN)

In [ ]:
len(df['email'])

In [ ]:
df.apply(len, axis='columns') #counts ACROSS

In [ ]:
df.apply(pd.Series.min) #gives values that come first in the alphabet

In [ ]:
df.apply(lambda x: x.min()) #gives same response as above using lambda

In [ ]:
df.applymap(len) #applies the length function to each individual value in the df

In [ ]:
df.applymap(str.lower) #makes all values in the df lowercase

In [ ]:
df['first'].map({'Corey': 'Chris','Jane':'Mary'}) #returns a series with the first name converted
                                                    #names we DIDN'T change returns as "NaN"

In [ ]:
df['first'].replace({'Corey': 'Chris','Jane':'Mary'}) #using replace instead of map gives us the original name
                                                            #if we don't replace

In [ ]:
df['first'] = df['first'].replace({'Corey': 'Chris','Jane':'Mary'}) #saves the changes we made
df

In [31]:
df['first'] + ' ' + df['last'] #puts the first name and last name together with a space

0    Corey Schafer
1         Jane Doe
2         John Doe
dtype: object

In [32]:
df['full_name'] = df['first'] + ' ' + df['last'] #adds a new column to the df called full_name
df #cannot use dot notation when making assignments as done above

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe
2   John      Doe        JohnDoe@email.com       John Doe

In [34]:
df.drop(columns=['first','last'],inplace=True) #drops the first and last columns
                                                #and saves the change
df

                     email      full_name
0  CoreyMSchafer@gmail.com  Corey Schafer
1        JaneDoe@email.com       Jane Doe
2        JohnDoe@email.com       John Doe

In [36]:
df['full_name'].str.split(' ',expand=True) #splitting the full_name string by a space
                                            #expand=True argument splits them into 2 columns

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

In [37]:
df[['first','last']] = df['full_name'].str.split(' ',expand=True) #adds a first and last
                                                                    #column from splitting
                                                                        #full_name
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe

In [39]:
df.append({'first': 'Tony'}, ignore_index=True) #curly bracket notation denotes passing in a dictionary
                                                    #NaN means "not a number" (missing values)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3                      NaN            NaN   Tony      NaN

In [40]:
people = {
    "first": ['Tony', 'Steve'],
    "last": ['Stark', 'Rogers'],
    "email": ['IronMan@avenge.com', 'Cap@avenge.com']
}
df2 = pd.DataFrame(people) #creating new dataframe from above
df2

   first    last               email
0   Tony   Stark  IronMan@avenge.com
1  Steve  Rogers      Cap@avenge.com

In [41]:
df.append(df2, ignore_index=True) #puts df and df2 together

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3       IronMan@avenge.com            NaN   Tony    Stark
4           Cap@avenge.com            NaN  Steve   Rogers

In [43]:
df3 = df.append(df2, ignore_index=True) #saves the new data frame as df3
df3

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3       IronMan@avenge.com            NaN   Tony    Stark
4           Cap@avenge.com            NaN  Steve   Rogers

In [44]:
df3.drop(index=4) #drops row 4 (corresponds to index 4)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3       IronMan@avenge.com            NaN   Tony    Stark

In [47]:
filt3 = df3['last'] == 'Doe' #saves conditional as an object first, makes code easier to read
df3.drop(index=df3[filt3].index) #removes values with last name Doe
                                                    #using conditional

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
3       IronMan@avenge.com            NaN   Tony    Stark
4           Cap@avenge.com            NaN  Steve   Rogers

In [51]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [52]:
df.sort_values(by='last') #sorts last names alphabetically (numbers sorted ascending)

   first     last                    email
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com
0  Corey  Schafer  CoreyMSchafer@gmail.com

In [53]:
df.sort_values(by='last', ascending=False) #sorts last names in reverse alphabetical order

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [57]:
df.sort_values(by=['last','first'], ascending=False) #sorts last names in reverse alphabetical first
                                                        #then sorts first names in reverse alphabetical order

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
2   John      Doe        JohnDoe@email.com
1   Jane      Doe        JaneDoe@email.com
3   Adam      Doe              A@email.com

In [59]:
df.sort_values(by=['last','first'], ascending=[False, True], inplace=True) #sorts last names in reverse alphabetical order first
df                                                                           #then sorts first names in alphabetical order

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
3   Adam      Doe              A@email.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [60]:
df.sort_index() #sorts the df by the index (ascending is default)

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com
3   Adam      Doe              A@email.com

In [61]:
df['last'].sort_values() #sorts last values only in ascending order

3        Doe
1        Doe
2        Doe
0    Schafer
Name: last, dtype: object

In [8]:
import pandas as pd
import numpy as np #imports required package to create people object below

In [9]:
people = {
    'first': ['Corey', 'Jane', 'John', 'Chris', np.nan, None, 'NA'], 
    'last': ['Schafer', 'Doe', 'Doe', 'Schafer', np.nan, np.nan, 'Missing'], 
    'email': ['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com', None, np.nan, 'Anonymous@email.com', 'NA'],
    'age': ['33', '55', '63', '36', None, None, 'Missing']
}

In [18]:
df = pd.DataFrame(people)
df.replace('NA',np.nan, inplace=True) #replaces all NA strings with np.nan and saves changes
df.replace('Missing',np.nan, inplace=True) #replaces all Missing strings with np.nan and
                                            #saves changes
df

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@email.com    55
2   John      Doe        JohnDoe@email.com    63
3  Chris  Schafer                     None    36
4    NaN      NaN                      NaN  None
5   None      NaN      Anonymous@email.com  None
6    NaN      NaN                      NaN   NaN

In [11]:
df.dropna() #drops all rows with NaN values

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
6     NA  Missing                       NA  Missing

In [12]:
df.dropna(axis='index',how='any') #same results as above with default arguments

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
6     NA  Missing                       NA  Missing

In [14]:
df.dropna(axis='columns',how='all') #returns original df since we have no columns with 
                                        #all missing values

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
3  Chris  Schafer                     None       36
4    NaN      NaN                      NaN     None
5   None      NaN      Anonymous@email.com     None
6     NA  Missing                       NA  Missing

In [15]:
df.dropna(axis='columns',how='any') #returns empty df

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6]

In [16]:
df.dropna(axis='index',how='any',subset=['email']) #returns df where email is filled in
                                                    #(NA is a string)

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
5   None      NaN      Anonymous@email.com     None
6     NA  Missing                       NA  Missing

In [17]:
df.dropna(axis='index',how='all',subset=['last','email']) #rows will only be dropped if BOTH
                                                            #last and email are missing

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
3  Chris  Schafer                     None       36
5   None      NaN      Anonymous@email.com     None
6     NA  Missing                       NA  Missing

In [19]:
df.isna() #tells us which values are classified as NaN

   first   last  email    age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False   True  False
4   True   True   True   True
5   True   True  False   True
6   True   True   True   True

In [20]:
df.fillna('MISSING') #makes all NaN values MISSING
    #with numerical data, should make missing 0 and non-missing 1

     first     last                    email      age
0    Corey  Schafer  CoreyMSchafer@gmail.com       33
1     Jane      Doe        JaneDoe@email.com       55
2     John      Doe        JohnDoe@email.com       63
3    Chris  Schafer                  MISSING       36
4  MISSING  MISSING                  MISSING  MISSING
5  MISSING  MISSING      Anonymous@email.com  MISSING
6  MISSING  MISSING                  MISSING  MISSING

In [21]:
df.dtypes #all columns are objects (strings or mix of dif things)

first    object
last     object
email    object
age      object
dtype: object

In [22]:
df['age'].mean() #we get an error because the ages are input as strings

TypeError: can only concatenate str (not "int") to str

In [23]:
type(np.nan)

float

In [27]:
df['age'] = df['age'].astype(float)

In [28]:
df.dtypes #now age is a float type

first     object
last      object
email     object
age      float64
dtype: object